In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
#Définir un objet Series comprenant la population de 5 pays puis afficher les pays ayant une population > 50’000’000

ma_serie=Series([60,8,30,250], index=["France","Suisse", "Espagne", "Etats-Unis"])
print (ma_serie[ma_serie>50])

France         60
Etats-Unis    250
dtype: int64

In [3]:
#Définir les noms de l’objet et de la colonne des pays pour la Series précédente
ma_serie.name="Populations"
ma_serie.index.name="Pays"

In [4]:
#Construire un dictionnaire avec des produits et des prix puis afficher la DataFrames obtenue en transformant ce dictionnaire
dico_prix={ 'legume':['tomate','carotte', 'chou'],'prix':[2.2, 3, 1.43]}
frame_prix=DataFrame(dico_prix)
frame_prix

    legume  prix
0   tomate  2.20
1  carotte  3.00
2     chou  1.43

In [5]:
#Récupérez les données de Wikipédia sur les résultats de NBA et obtenir les statistiques descriptives pour les variables quantitatives.
import webbrowser
url='https://en.wikipedia.org/wiki/List_of_all-time_NBA_win-loss_records'
webbrowser.open(url)

True

In [6]:
#copier depuis le clipboard
frame2=pd.read_clipboard(sep='\s+')

In [8]:
#on transforme les variables mal importées
frame2.columns
frame2["Won"]=frame2["Won"].str.replace(',', '')
frame2["Lost"]=frame2["Won"].str.replace(',', '')
frame2["Total Games"]=frame2["Won"].str.replace(',', '')
del frame2['First NBA Season']
frame2 = frame2.convert_objects(convert_numeric=True)

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:7: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.

In [9]:
#on affiche les stats descriptives
frame2.describe()

            Rank          Won         Lost       Pct.  Total Games
count  30.000000    30.000000    30.000000  30.000000    30.000000
mean   15.500000  1852.966667  1852.966667   0.494000  1852.966667
std     8.803408   737.296342   737.296342   0.056163   737.296342
min     1.000000   528.000000   528.000000   0.391000   528.000000
25%     8.250000  1387.250000  1387.250000   0.460250  1387.250000
50%    15.500000  1987.000000  1987.000000   0.495000  1987.000000
75%    22.750000  2382.750000  2382.750000   0.521500  2382.750000
max    30.000000  3235.000000  3235.000000   0.621000  3235.000000

In [10]:
#Construire un objet Series quelconque avec des libellés (index) de A à D puis réindexer l’objet avec une liste de A à E. 
X=Series([1,3,4,5], index=["a","b","c","d"])
X

a    1
b    3
c    4
d    5
dtype: int64

In [11]:
X=X.reindex(["a","b","c","d","e"])

In [12]:
#Recommencer en ajoutant F avec la valeur 0
X=X.reindex(["a","b","c","d","e","f"], fill_value=0)

In [13]:
#Construire un objet DataFrame à 2 dimensions avec des labels pour les lignes et pour les colonnes. 
Y=DataFrame([[1,2,3],[3,4,5]],index=["obs1","obs2"], columns=["col1","col2","col3"])


#Ajouter une colonne en réindexant les colonnes 
Y=Y.reindex(columns=["col1","col2","col3","col4"], fill_value=22)

#supprimer cette colonne
Y=Y.drop("col4",axis=1)

#afficher uniquement les valeurs  plus grandes que 4
Y[Y>4]

      col1  col2  col3
obs1   NaN   NaN   NaN
obs2   NaN   NaN     5

In [14]:
#Construire deux frames avec quelques colonnes et lignes en commun puis combinez-les.
Z=DataFrame([[10,20,30],[55,55,23]],index=["obs1","obs3"], columns=["col1","col2","col4"])

Y.add(Z,fill_value=0)

      col1  col2  col3  col4
obs1    11    22     3    30
obs2     3     4     5   NaN
obs3    55    55   NaN    23

In [20]:
#Trier les données NBA en fonction de la variable pts.
frame2.columns

Index([u'Rank', u'Team', u'Won', u'Lost', u'Pct.', u'Total Games',
       u'Division'],
      dtype='object')

In [21]:
NBA_trier=frame2.sort_values("Pct.")

In [22]:
#Créer un DataFrame de taille 4 x 3 et obtenir les différentes statistiques descriptives.
Frame4=np.array(range(12)).reshape(4,3)
Frame4 = DataFrame(Frame4,index=['A','B','C','D'],columns = ['un','deux','trois'])
Frame4

   un  deux  trois
A   0     1      2
B   3     4      5
C   6     7      8
D   9    10     11

In [25]:
#somme par colonne
print Frame4.sum(axis=0)
#somme par ligne
print Frame4.sum(axis=1)
#stat desc
print Frame4.describe()
#matrice de corrélation
print Frame4.corr()

un       18
deux     22
trois    26
dtype: int64
A     3
B    12
C    21
D    30
dtype: int64
             un       deux      trois
count  4.000000   4.000000   4.000000
mean   4.500000   5.500000   6.500000
std    3.872983   3.872983   3.872983
min    0.000000   1.000000   2.000000
25%    2.250000   3.250000   4.250000
50%    4.500000   5.500000   6.500000
75%    6.750000   7.750000   8.750000
max    9.000000  10.000000  11.000000
       un  deux  trois
un      1     1      1
deux    1     1      1
trois   1     1      1

In [27]:
#Importez le fichier demo_ventes.csv depuis Python dans FrameVentes.
FrameVentes = pd.read_csv("demo_ventes.csv",sep=";",decimal=",")
FrameVentes.head()

   account     Jan     Feb    Mar
0   211829   10000   62000  35000
1   320563   95000   45000  35000
2   648336   91000  120000  35000
3   109996   45000  120000  10000
4   121213  162000  120000  35000

In [28]:
#Importez un tableau en html depuis la page 
url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'
webbrowser.open(url)

True

In [32]:
#Importez un tableau en html depuis la page http://www.fdic.gov/bank/individual/failed/banklist.html 
from pandas import read_html
dframe_list = pd.io.html.read_html(url)
Frame5=dframe_list[0]
Frame5.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date,Loss Share Type,Agreement Terminated,Termination Date
0,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","May 12, 2016",NaN,NaN,NaN
1,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","May 10, 2016",NaN,NaN,NaN
2,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","April 22, 2016",NaN,NaN,NaN
3,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","April 13, 2016",NaN,NaN,NaN
4,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","April 13, 2016",NaN,NaN,NaN

In [31]:
#Importez un fichier Excel depuis python. On utilisera demo_excel.xlsx
FrameExcel = pd.read_excel("excel-data.xlsx")
FrameExcel.head()

,account,name,street,city,state,postal-code
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681

In [33]:
#Joindre les deux dataframes de ventes en utilisant l’id.
CompleteFrame=pd.merge(FrameExcel,FrameVentes,on="account")
CompleteFrame.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [34]:
#Créez deux Series et utilisez pd.concat pour les concaténer par colonne.
serie1 =  Series([0,1,2],index=['T','U','V'])
serie2 = Series([3,4],index=['X','Y'])
pd.concat([serie1,serie2])

T    0
U    1
V    2
X    3
Y    4
dtype: int64

In [35]:
#Créez deux DataFrame avec des missing et essayez de remplacer les valeurs manquantes du premier par les valeurs présentes dans le second en utilisant la seconde méthode.
serie1 = Series([2,np.nan,4,np.nan,6,np.nan],
           index=['Q','R','S','T','U','V'])

serie2 = Series(np.arange(len(serie1), dtype=np.float64),
           index=['Q','R','S','T','U','V'])

serie2[-1] = np.nan

In [36]:
serie1.combine_first(serie2)

Q     2
R     1
S     4
T     3
U     6
V   NaN
dtype: float64

In [37]:
#Créez un DataFrame 4 x 3 avec des index sur les lignes et les colonnes. Transformez ce DataFrame en utilisant stack.
Frame4.stack()

A  un        0
   deux      1
   trois     2
B  un        3
   deux      4
   trois     5
C  un        6
   deux      7
   trois     8
D  un        9
   deux     10
   trois    11
dtype: int32

In [38]:
#Créez un DataFrame avec comme variables 4 villes de différents pays et leur population. 
frame_ville= DataFrame({'ville':['Paris','Rome','New York',"Lyon"],
                    'population':[5000000,9000000,3000000,1500000 ]})

frame_ville

   population     ville
0     5000000     Paris
1     9000000      Rome
2     3000000  New York
3     1500000      Lyon

In [40]:
#Créez une variable dans le dataframe des ventes pour obtenir des niveaux de ventes.
FrameVentes["level"]=pd.cut(FrameVentes["Jan"],5)
FrameVentes.head()

   account     Jan     Feb    Mar             level
0   211829   10000   62000  35000     (9848, 40400]
1   320563   95000   45000  35000   (70800, 101200]
2   648336   91000  120000  35000   (70800, 101200]
3   109996   45000  120000  10000    (40400, 70800]
4   121213  162000  120000  35000  (131600, 162000]

In [41]:
#Créez un DataFrame quelconque puis permutez ses éléments aléatoirement.

dframe = DataFrame(np.arange(4 * 4).reshape((4, 4)))
permut = np.random.permutation(4)
dframe.take(permut)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7

In [42]:
#cas du Basket
frame2.groupby('Division').describe()

                        Lost      Pct.       Rank  Total Games          Won
Division
Atlantic  count     5.000000  5.000000   5.000000     5.000000     5.000000
          mean   2148.400000  0.490800  16.600000  2148.400000  2148.400000
          std    1050.185841  0.066428  10.163661  1050.185841  1050.185841
          min     734.000000  0.421000   3.000000   734.000000   734.000000
          25%    1360.000000  0.438000  11.000000  1360.000000  1360.000000
          50%    2701.000000  0.493000  16.000000  2701.000000  2701.000000
          75%    2726.000000  0.514000  26.000000  2726.000000  2726.000000
          max    3221.000000  0.588000  27.000000  3221.000000  3221.000000
Central   count     5.000000  5.000000   5.000000     5.000000     5.000000
          mean   2009.600000  0.496000  15.200000  2009.600000  2009.600000
          std     394.249033  0.022237   5.263079   394.249033   394.249033
          min    1606.000000  0.464000   8.000000  1606.000000  1606.000000
          25%    1728.000000  0.487000  13.000000  1728.000000  1728.000000
          50%    1983.000000  0.497000  15.000000  1983.000000  1983.000000
          75%    2115.000000  0.510000  18.000000  2115.000000  2115.000000
          max    2616.000000  0.522000  22.000000  2616.000000  2616.000000
Northwest count     5.000000  5.000000   5.000000     5.000000     5.000000
          mean   1671.000000  0.496600  13.400000  1671.000000  1671.000000
          std     508.133841  0.063208  10.876580   508.133841   508.133841
          min     847.000000  0.391000   5.000000   847.000000   847.000000
          25%    1563.000000  0.484000   6.000000  1563.000000  1563.000000
          50%    1815.000000  0.534000   7.000000  1815.000000  1815.000000
          75%    1991.000000  0.535000  19.000000  1991.000000  1991.000000
          max    2139.000000  0.539000  30.000000  2139.000000  2139.000000
Pacific   count     5.000000  5.000000   5.000000     5.000000     5.000000
          mean   2376.000000  0.495000  15.600000  2376.000000  2376.000000
          std     647.801281  0.081003  11.970798   647.801281   647.801281
          min    1469.000000  0.394000   2.000000  1469.000000  1469.000000
          25%    2122.000000  0.459000   4.000000  2122.000000  2122.000000
          50%    2464.000000  0.473000  20.000000  2464.000000  2464.000000
          75%    2590.000000  0.546000  23.000000  2590.000000  2590.000000
          max    3235.000000  0.603000  29.000000  3235.000000  3235.000000
Southeast count     5.000000  5.000000   5.000000     5.000000     5.000000
          mean   1560.400000  0.479800  17.800000  1560.400000  1560.400000
          std     741.632524  0.033767   6.760178   741.632524   741.632524
          min     916.000000  0.440000   9.000000   916.000000   916.000000
          25%    1062.000000  0.450000  14.000000  1062.000000  1062.000000
          50%    1170.000000  0.490000  17.000000  1170.000000  1170.000000
          75%    2004.000000  0.499000  24.000000  2004.000000  2004.000000
          max    2650.000000  0.520000  25.000000  2650.000000  2650.000000
Southwest count     5.000000  5.000000   5.000000     5.000000     5.000000
          mean   1352.400000  0.505800  14.400000  1352.400000  1352.400000
          std     715.289312  0.076228  10.406729   715.289312   715.289312
          min     528.000000  0.415000   1.000000   528.000000   528.000000
          25%     694.000000  0.466000  10.000000   694.000000   694.000000
          50%    1482.000000  0.510000  12.000000  1482.000000  1482.000000
          75%    2006.000000  0.517000  21.000000  2006.000000  2006.000000
          max    2052.000000  0.621000  28.000000  2052.000000  2052.000000

In [43]:
#Créez un objet Series et ajoutez des dates partant du 3 décembre 2015 par jour jusqu’à aujourd’hui.
date=pd.date_range('12-03-2015',periods=5,freq='d')

serieD=Series(range(5), index=date)
serieD

2015-12-03    0
2015-12-04    1
2015-12-05    2
2015-12-06    3
2015-12-07    4
Freq: D, dtype: int64